{
  "E_PR1001": {
    "msg": "An error has occured while resetting your password. Please contact the support and provide them with the error code E_PR1001",
    "desc": "Error occured while trying to query the DB for the existence of the use through email during the request password reset procedure."
  },
  "E_PR1002": {
    "msg": "There is no account associated with this email address.",
    "desc": "User probabily input an incorrect email address during the request password reset procedure."
  },
  "E_PR1003": {
    "msg": "This account has not been verified yet. Please check your email address for our account confirmation email or if the email link has expired, signup again.",
    "desc": "The account has not been verfied yet upon the check of the user verification during the request password reset procedure."
  },
  "E_PR1004": {
    "msg": "An error has occured while resetting your password. Please contact the support and provide them with the error code E_PR1004.",
    "desc": "Error occured while trying to delete the existing password resets from the DB during the request password reset procedure."
  },
  "E_PR1005": {
    "msg": "An error has occured while resetting your password. Please contact the support and provide the error code E_PR1005",
    "desc": "Error occured while trying to hash the unique string during the the request password reset procedure."
  },
  "E_PR1006": {
    "msg": "An error has occured while resetting your password. Please contact the support and provide them with the error code E_PR1006.",
    "desc": "Error occured while trying to save the new password reset document in the DB during the request password reset procedure."
  },
  "E_PR1007": {
    "msg": "An error has occured while resetting your password. Please contact the support and provide them with the error code E_PR1007.",
    "desc": "Error occured while trying to sthe email during the request password reset procedure."
  },
  "E_PR1008": {
    "msg": "An error has occured while resetting your password. Please contact the support and provide them with the error code E_PR1008.",
    "desc": "Error occured while looking for a password reset document that matches the user id during password reset procedure."
  },
  "E_PR1009": {
    "msg": "The password reset request for this email has not been initiated.",
    "desc": "The request password reset has not been initiated by the user during password reset procedure."
  },
  "E_PR1010": {
    "msg": "An error has occured while resetting your password. Please contact the support and provide them with the error code E_PR1010.",
    "desc": "Error occured while deleting the existing password reset doc during password reset procedure."
  },
  "E_PR1011": {
    "msg": "The password reset link has expired. Please perform another password reset request",
    "desc": "The password request link has expired."
  },
  "E_PR1012": {
    "msg": "An error has occured while resetting your password. Please contact the support and provide them with the error code E_PR1012.",
    "desc": "Error occured while comparing the password reset string with the hashed password reset string during password reset procedure."
  },
  "E_PR1013": {
    "msg": "An error has occured while resetting your password. Please contact the support and provide them with the error code E_PR1013.",
    "desc": "Error occured while hasing the new password during password reset procedure."
  }  ,
  "E_PR1014": {
    "msg": "An error has occured while resetting your password. Please contact the support and provide them with the error code E_PR1014.",
    "desc": "Error occured while updating the user with the new password during password reset procedure."
  },
  "E_PR1015": {
    "msg": "An error has occured while resetting your password. Please contact the support and provide them with the error code E_PR1015.",
    "desc": "Error occured while sending the final response during password reset procedure."
  },
  "E_PR1016": {
    "msg": "The link you came here with has been tampered and cannot be used. Please try again to click the link in the email. If the problem persists contact support",
    "desc": "The resetString from the email is not the same as the resetString from the DB record associated witht this email"
  }
}